mikewang01/GOWATCH/ClingGo_NRF52/project/adapters/osal.h
/**
 * \addtogroup BSP
 * \{
 * \addtogroup OSAL
 * 
 * \brief OS Abstraction Layer
 *
 * \{
 */

/**
 ****************************************************************************************
 *
 * @file osal.h
 *
 * @brief OS abstraction layer API
 *
 * Copyright (C) 2015. Dialog Semiconductor Ltd, unpublished work. This computer
 * program includes Confidential, Proprietary Information and is a Trade Secret of
 * Dialog Semiconductor Ltd. All use, disclosure, and/or reproduction is prohibited
 * unless authorized in writing. All Rights Reserved.
 *
 * <black.orca.support@diasemi.com> and contributors.
 *
 ****************************************************************************************
 */

#ifndef OSAL_H_
#define OSAL_H_


#if defined(OS_FREERTOS)


#include "nrf_assert.h"
#include "app_util_platform.h"
#include  "nrf_assert.h"

#define OS_STACK_WORD_SIZE      (sizeof(StackType_t))

#define OS_TASK                 uint32_t
#define OS_TASK_CREATE_SUCCESS  pdPASS
#define OS_TASK_NOTIFY_SUCCESS  pdPASS
#define OS_TASK_NOTIFY_FAIL     pdFALSE
#define OS_TASK_NOTIFY_NO_WAIT  0
#define OS_TASK_NOTIFY_FOREVER  portMAX_DELAY
#define OS_TASK_NOTIFY_ALL_BITS 0xFFFFFFFF

#define OS_TASK_PRIORITY_LOWEST    tskIDLE_PRIORITY
#define OS_TASK_PRIORITY_NORMAL    tskIDLE_PRIORITY + 1
#define OS_TASK_PRIORITY_HIGHEST   configMAX_PRIORITIES - 1

#define OS_MUTEX                SemaphoreHandle_t
#define OS_MUTEX_TAKEN          pdTRUE
#define OS_MUTEX_CREATE_SUCCESS 1
#define OS_MUTEX_CREATE_FAILED  0
#define OS_MUTEX_NO_WAIT        0
#define OS_MUTEX_FOREVER        portMAX_DELAY

#define OS_EVENT                uint32_t
#define OS_EVENT_SIGNALED       pdTRUE
#define OS_EVENT_NO_WAIT        0
#define OS_EVENT_FOREVER        0

#define OS_EVENT_GROUP          EventGroupHandle_t
#define OS_EVENT_GROUP_OK       pdTRUE
#define OS_EVENT_GROUP_FAIL     pdFALSE
#define OS_EVENT_GROUP_FOREVER  portMAX_DELAY

#define OS_QUEUE                QueueHandle_t
#define OS_QUEUE_FULL           errQUEUE_FULL
#define OS_QUEUE_EMPTY          pdFALSE
#define OS_QUEUE_OK             pdTRUE
#define OS_QUEUE_NO_WAIT        0
#define OS_QUEUE_FOREVER        portMAX_DELAY

#define OS_TIMER                TimerHandle_t
#define OS_TIMER_SUCCESS        pdPASS
#define OS_TIMER_FAIL           pdFAIL
#define OS_TIMER_FOREVER        portMAX_DELAY

#define OS_BASE_TYPE            BaseType_t

#define OS_OK                   pdPASS
#define OS_FAIL                 pdFAIL

#define OS_IRB                  IRB_t

#define OS_TICK_TIME            TickType_t
#define OS_PERIOD_MS            portTICK_PERIOD_MS

#define OS_ASSERT               ASSERT

#define  pdTRUE  								1
#define  pdFALSE 								0


#define  ASSERT_ERROR      OS_ASSERT 
#define  ASSERT_WARNING    OS_ASSERT  
/**
 * \brief OS Notification action
 */
typedef enum {
        OS_NOTIFY_NO_ACTION = 0,                                /**< subject task receives event, but its notification value is not updated */
        OS_NOTIFY_SET_BITS = 1,                                  /**< notification value of subject task will be bitwise ORed with task value */
        OS_NOTIFY_INCREMENT = 2,                               /**< notification value of subject task will be incremented by one */
        OS_NOTIFY_VAL_WITH_OVERWRITE = 3,          /**< notification value of subject task is unconditionally set to task value */
        OS_NOTIFY_VAL_WITHOUT_OVERWRITE = 4,    /**< if subject task has a notification pending then notification value
                                                                             will be set to task value otherwise task value is not updated */
} OS_NOTIFY_ACTION;

/**
 * \brief Converts a time in milliseconds to a time in ticks
 *
 * \param [in] time_in_ms time in milliseconds
 *
 * \return time in ticks
 *
 */
#define OS_TIME_TO_TICKS(time_in_ms) pdMS_TO_TICKS(time_in_ms)

/**
 * \brief Return current OS task handle
 *
 * \return current task handle of type OS_TASK
 *
 */
#define OS_GET_CURRENT_TASK() 0

/**
 * \brief Create OS task
 *
 * Function creates OS task. Task is added to ready list.
 *
 * \param [in] name task name
 * \param [in] task_func starting point of task
 * \param [in] arg parameter past to \p task_func on task start
 * \param [in] stack_size stack size allocated for task in bytes
 * \param [in] priority number specifying task priority
 * \param [in,out] task OS specific task handle
 *
 * \return OS_TASK_CREATE_SUCCESS if task was created successfully
 *
 */
#define OS_TASK_CREATE(name, task_func, arg, stack_size, priority, task) \
                        xTaskCreate((task_func), (name), \
                                                (((stack_size) - 1) / sizeof(StackType_t) + 1), \
                                                                        (arg), (priority), &(task))

/**
 * \brief Delete OS task
 *
 * Function deletes OS task.
 *
 * \param [in,out] task OS specific task handle
 *
 */
#define OS_TASK_DELETE(task) vTaskDelete(task)

/**
 * \brief Send an event directly to task
 *
 * Must not be called from ISR!
 *
 * \param [in] task id of task to notify
 * \param [in] value used to update the notification value of the subject \p task
 * \param [in] action action that performs when notify is occurred
 *
 * \return OS_TASK_NOTIFY_FAIL if \p action is set as OS_NOTIFY_VAL_WITHOUT_OVERWRITE and \p task
 *         already had a notification pending, OS_TASK_NOTIFY_SUCCESS otherwise
 *
 */
#define OS_TASK_NOTIFY(task, value, action) xTaskNotify((task), (value), (action))

/**
 * \brief Notify OS task sending an event and return previous notification value
 *
 * Must not be called from ISR!
 *
 * \param [in] task id of task to notify
 * \param [in] value used to update the notification value of the subject \p task
 * \param [in] action action that performs when notify is occurred
 * \param [out] prev_value pointer to previous notification value - optional - can be set to NULL
 *
 * \return OS_TASK_NOTIFY_FAIL if \p action is set as OS_NOTIFY_VAL_WITHOUT_OVERWRITE and \p task
 *         already had a notification pending, OS_TASK_NOTIFY_SUCCESS otherwise
 *
 */
#define OS_TASK_NOTIFY_AND_QUERY(task, value, action, prev_value) xTaskNotifyAndQuery((task), \
                                                                (value), (action), (prev_value))

/**
 * \brief Send an event and unblock OS task with updating notification value
 *
 * A version of OS_TASK_NOTIFY that can be called from ISR.
 *
 * \param [in] task id of task to notify
 * \param [in] value used to update the notification value of the subject \p task
 * \param [in] action action that performs when notify is occurred
 *
 * \return OS_TASK_NOTIFY_FAIL if \p action is set as OS_NOTIFY_VAL_WITHOUT_OVERWRITE and \p task
 *         already had a notification pending, OS_TASK_NOTIFY_SUCCESS otherwise
 *
 */
#define OS_TASK_NOTIFY_FROM_ISR(task, value, action) \
        ({ \
                BaseType_t need_switch, ret; \
                ret = xTaskNotifyFromISR(task, value, action, &need_switch); \
                portEND_SWITCHING_ISR(need_switch); \
                ret; \
        })

/**
 * \brief Notify task and receive OS task notification value
 *
 * Must not called from ISR! Use OS_TASK_NOTIFY_GIVE_FROM_ISR instead.
 *
 * \param [in] task id of task to notify
 *
 * \return OS_TASK_NOTIFY_GIVE calls OS_TASK_NOTIFY with action set to OS_NOTIFY_INCREMENT resulting
 *         in all calls returning OS_TASK_NOTIFY_SUCCESS
 *
 */
#define OS_TASK_NOTIFY_GIVE(task) xTaskNotifyGive(task)

/**
 * \brief Notify task from ISR
 *
 * Send notification from interrupt service routine (ISR) to \p task that can unblock the receiving
 * task and optionally update the receiving task's notification value.
 * This function is safe to call from ISR.
 *
 * \param [in] task id of task to notify
 *
 */
#define OS_TASK_NOTIFY_GIVE_FROM_ISR(task) \
        ({ \
                BaseType_t need_switch; \
                vTaskNotifyGiveFromISR(task, &need_switch); \
                portEND_SWITCHING_ISR(need_switch); \
        })

/**
 * \brief Clear to zero or decrement task notification value on exit
 *
 * \param [in] clear_on_exit = pdFASLE: RTOS task's notification value is decremented before
 *                             OS_TASK_NOTIFY_TAKE() exits,
 *                             pdTRUE: the RTOS task's notification value is reset to 0 before
 *                             OS_TASK_NOTIFY_TAKE() exits.
 * \param [in] time_to_wait maximum time to wait in the blocked state for a notification to be
 *                          received if a notification is not already pending when
 *                          OS_TASK_NOTIFY_TAKE() is called
 *
 * \return the value of the task's notification value before it is decremented or cleared
 *
 */
#define OS_TASK_NOTIFY_TAKE(clear_on_exit, time_to_wait) ulTaskNotifyTake((clear_on_exit), \
                                                                                (time_to_wait))

/**
 * \brief Wait for the calling task to receive a notification
 *
 * \param [in] entry_bits any bits set in entry_bits will be cleared in calling notification value
 *                        before enters to OS_TASK_NOTIFY_WAIT
 * \param [in] exit_bits any bits set in exit_bits will be cleared in calling notification value
 *                       before OS_TASK_NOTIFY_WAIT function exits if a notification was received
 * \param [out] value pointer to task's notification value, if not required can be set to NULL
 * \param [in] ticks_to_wait maximum time to wait in the blocked state for a notification to be
 *                           received if a notification is not already pending when
 *                           OS_TASK_NOTIFY_WAIT is called
 *
 * \return OS_TASK_NOTIFY_SUCCESS if notification was received or was already pending when
 *         OS_TASK_NOTIFY_WAIT was called
 *         OS_TASK_NOTIFY_FAIL if the call OS_TASK_NOTIFY_WAIT timed out before notification was
 *         received
 *
 */
#define OS_TASK_NOTIFY_WAIT(entry_bits, exit_bits, value, ticks_to_wait) \
                                xTaskNotifyWait((entry_bits), (exit_bits), (value), \
                                                                                (ticks_to_wait))

/**
 * \brief Resume task
 *
 * Make \p task ready to run.
 *
 * \param [in] task id of task to resume
 *
 */
#define OS_TASK_RESUME(task) vTaskResume(task)

/**
 * \brief Resume task
 *
 * Make \p task ready to run. This function is safe to call from ISR.
 *
 * \param [in] task id of task to resume
 *
 */
#define OS_TASK_RESUME_FROM_ISR(task) vTaskResumeFromISR(task)

/**
 * \brief Suspend task
 *
 * Remove \p task from execution queue. Task will not be run
 * until OS_TASK_RESUME or OS_TASK_RESUME_FROM_ISR is called.
 *
 * \param [in] task id of task to suspend
 *
 */
#define OS_TASK_SUSPEND(task) vTaskSuspend(task)

/**
 * \brief Suspend task
 *
 * Remove \p task from execution queue. Task will not be run
 * until OS_TASK_RESUME or OS_TASK_RESUME_FROM_ISR is called.
 * This function is safe to call from ISR.
 *
 * \param [in] task id of task to suspend
 *
 */
#define OS_TASK_SUSPEND_FROM_ISR(task) vTaskSuspendFromISR(task)

/**
 * \brief Create OS mutex
 *
 * Function creates OS mutex.
 *
 * \param [in,out] mutex
 *
 * \return OS_MUTEX_CREATE_SUCCESS when mutex was created successfully, OS_MUTEX_CREATE_FAILED
 *         otherwise
 */
#define OS_MUTEX_CREATE(mutex) \
        ({ \
                (mutex) = xSemaphoreCreateRecursiveMutex(); \
                mutex != NULL ? OS_MUTEX_CREATE_SUCCESS : OS_MUTEX_CREATE_FAILED; \
        })

/**
 * \brief Delete OS mutex
 *
 * Function deletes OS mutex.
 *
 * \param [in] mutex
 *
 */
#define OS_MUTEX_DELETE(mutex) vSemaphoreDelete(mutex)

/**
 * \brief Relase mutex
 *
 * Decrease mutex count, when numer of calls to OS_MUTEX_GET equals number of calls to
 * OS_MUTEX_PUT, mutex can be acquired by other task.
 *
 * \param [in] mutex id of mutex to realse
 *
 */
#define OS_MUTEX_PUT(mutex) xSemaphoreGiveRecursive(mutex)

/**
 * \brief Acquire mutex
 *
 * Access to shared resource can be guarded by mutex. When task wants to get access
 * to this resource call OS_MUTEX_GET. If mutex was not taken by any task yet it, call
 * will succeed and mutex will be assigned to calling task. Next call to already acquired
 * mutex from same task will succeed. If mutex is already taken by other task calling
 * task will wait for specified time before failing.
 * For non-blocking acquire \p timeout can be OS_MUTEX_NO_WAIT, for infinite wait till
 * mutex is released OS_MUTEX_FOREVER should be used.
 *
 * \param [in] mutex id of mutex to acquire
 * \param [in] timeout number of ticks that to acquire mutex
 *
 */
#define OS_MUTEX_GET(mutex, timeout) xSemaphoreTakeRecursive((mutex), (timeout))

/**
 * \brief Create OS event
 *
 * Function creates OS event that can be used to synchronize.
 *
 * \param [in,out] event
 *
 */
#define OS_EVENT_CREATE(event) do { event = pdFALSE; } while(0)

/**
 * \brief Delete OS event
 *
 * Function destroys OS event.
 *
 * \param [in] event item to delete
 *
 */
#define OS_EVENT_DELETE(event) do { event = pdFALSE; } while(0)

/**
 * \brief Set event in signaled state
 *
 * Set event in signaled stated so OS_EVENT_WAIT will release waiting task if any.
 * Event will remain in signaled stated till call to OS_EVENT_WAIT releases one task.
 * This function should not be called from ISR.
 *
 * \param [in] event
 *
 */
#define OS_EVENT_SIGNAL(event) do { event = pdFALSE; } while(0)

/**
 * \brief Set event in signaled state
 *
 * Set event in signaled stated so OS_EVENT_WAIT will release waiting task if any.
 * Event will remain in signaled stated till call to OS_EVENT_WAIT releases one task.
 * This function is safe to call from ISR.
 *
 * \param [in] event
 *
 */
#define OS_EVENT_SIGNAL_FROM_ISR(event) do { event = pdFALSE; } while(0)
/**
 * \brief Wait for event
 *
 * This function wait for \p event to be in signaled stated.
 * If event was already in signaled state or become signaled in specified time
 * function will return OS_EVENT_SIGNALED.
 * To check if event is already signaled use OS_EVENT_NO_WAIT as timeout.
 * To wait till event is signaled use OS_EVENT_FOREVERE.
 * This function can't be used in ISR.
 *
 * \param [in] event if of event to wait on
 * \param [in] timeout number of ticks to wait
 *
 * \return OS_EVENT_SIGNALED if event was signaled other value if not
 *
 */
#define OS_EVENT_WAIT(event, timeout, result) do { if(event == pdFALSE){event = pdTRUE;\
								result = pdTRUE;\
								}else{\
									result = pdFALSE;\
								}\
} while(0)


/**
 * \brief Check if event is signaled without waiting
 *
 * This function will return immediately with OS_EVENT_SIGNALED if event
 * was in signaled state already.
 *
 * \param [in] event if of event to wait on
 *
 * \return OS_EVENT_SIGNALED if event was signaled other value if not
 *
 */
#define OS_EVENT_CHECK(event) xSemaphoreTake((event), OS_EVENT_NO_WAIT)

#define OS_EVENT_YIELD(higherPriorityTaskWoken) portYIELD_FROM_ISR(higherPriorityTaskWoken)

/**
 * \brief Create OS event group
 *
 * Function creates OS event group
 *
 * \return event group handle if successful, otherwise NULL
 *
 */
#define OS_EVENT_GROUP_CREATE() xEventGroupCreate()

/**
 * \brief Event group wait bits
 *
 * Function reads bits within event group optionally entering the Blocked state (with a timeout)
 * to wait for a bit or group of bits to become set.
 *
 * \param [in] event_group the event group in which the bits are being tested
 * \param [in] bits_to_wait a bitwise value to test inside the event group
 * \param [in] clear_on_exit = OS_OK: any bits set in the value passed as the bits_to_wait
 *                             parameter will be cleared in the event group before
 *                             xEventGroupWaitBits returns
 *                             OS_FAIL: bits in the event group are not altered when the call
 *                             to xEventGroupWaitBits() returns
 * \param [in] wait_for_all = OS_OK: xEventGroupWaitBits() will return when either *all* bits
 *                            set in the value passed as the bits_to_wait parameter are set in
 *                            the event group
 *                            OS_FAIL: xEventGroupWaitBits() will return when *any* of the bits set
 *                            in the value passed as the bits_to_wait parameter are set in the event
 *                            group
 * \param [in] timeout maximum amount of time to wait for one/all of the bits specified
 *                     by bits_to_wait to become set
 *
 * \return the value of the event group at the time either the event bits being waited for
 *         became set, or the timeout expired
 *
 */
#define OS_EVENT_GROUP_WAIT_BITS(event_group, bits_to_wait, clear_on_exit, wait_for_all, timeout) \
                                    xEventGroupWaitBits((event_group), (bits_to_wait), \
                                                         (clear_on_exit), (wait_for_all), (timeout))

/**
 * \brief Event group set bits
 *
 * Set bits (flags) within an event group
 *
 * \param [in] event_group the event group in which the bits are to be set
 * \param [in] bits_to_set a bitwise value that indicates the bit or bits to set in the event group
 *
 * \return the value of the event group at the time the call to xEventGroupSetBits() returns
 *
 */
#define OS_EVENT_GROUP_SET_BITS(event_group, bits_to_set) xEventGroupSetBits((event_group), \
                                                                                      (bits_to_set))

/**
 * \brief Set event group bits from ISR
 *
 * Set bits (flags) within an RTOS event group that can be called from an ISR.
 *
 * \param [in] event_group the event group in which the bits are to be set
 * \param [in] bits_to_set a bitwise value that indicates the bit or bits to set in the event group
 *
 * \return if the message was sent to the RTOS daemon task then OS_OK is returned,
 *         otherwise OS_FAIL is returned
 *
 */
#define OS_EVENT_GROUP_SET_BITS_FROM_ISR(event_group, bits_to_set) \
({ \
        BaseType_t need_switch, ret; \
        ret = xEventGroupSetBitsFromISR((event_group), (bits_to_set), &(need_switch)); \
        portEND_SWITCHING_ISR(need_switch); \
        ret; \
})

/**
 * \brief Clear event group bits
 *
 * Function clear bits (flags) within an event group.
 *
 * \param [in] event_group the event group in which the bits are to be cleared
 * \param [in] bits_to_clear a bitwise value that indicates the bit or bits to clear
 *                           in the event group
 *
 * \return value of the event group before the specified bits were cleared
 *
 */
#define OS_EVENT_GROUP_CLEAR_BITS(event_group, bits_to_clear) xEventGroupClearBits((event_group), \
                                                                                    (bits_to_clear))

/**
 * \brief Clear event group bits from an interrupt
 *
 * Function clear bits (flags) within an event group from an interrupt.
 *
 * \param [in] event_group the event group in which the bits are to be cleared
 * \param [in] bits_to_clear a bitwise value that indicates the bit or bits to clear
 *                           in the event group
 *
 * \return value of the event group before the specified bits were cleared
 *
 */
#define OS_EVENT_GROUP_CLEAR_BITS_FROM_ISR(event_group, bits_to_clear) \
                                         xEventGroupClearBitsFromISR((event_group), (bits_to_clear))

/**
 * \brief Get event group bits
 *
 * Function returns the current value of the event bits (event flags) in an event group.
 *
 * \param [in] event_group the event group being queried
 *
 * \return value of the event bits in the event group at the time
 *         OS_EVENT_GROUP_GET_BITS() was called
 *
 */
#define OS_EVENT_GROUP_GET_BITS(event_group) xEventGroupGetBits(event_group)

/**
 * \brief Get event group bits from an interrupt
 *
 * Function returns the current value of the event bits (event flags) in an event group from an
 * interrupt
 *
 * \param [in] event_group the event group being queried
 *
 * \return value of the event bits in the event group at the time OS_EVENT_GROUP_GET_BITS_FROM_ISR()
 *         was called
 *
 */
#define OS_EVENT_GROUP_GET_BITS_FROM_ISR(event_group) xEventGroupGetBitsFromISR(event_group)

/**
 * \brief Synchronize event group bits
 *
 * Atomically set bits (flags) within an event group, then wait for a combination of bits to be
 * set within the same event group.
 *
 * \param [in] event_group event group in which the bits are being set and tested
 * \param [in] bits_to_set bit or bits to set in the event group before determining if all
 *                         the bits specified by the bits_to_wait parameter are set
 * \param [in] bits_to_wait a bitwise value that indicates the bit or bits to test inside
 *                          the event group
 * \param [in] timeout maximum amount of time (specified in 'ticks') to wait for all the bits
 *                     specified by the bits_to_wait parameter value to become set
 *
 * \return value of the event group at the time either the bits being waited for became set,
 *         or the block time expired
 *
 */
#define OS_EVENT_GROUP_SYNC(event_group, bits_to_set, bits_to_wait, timeout) \
                                    xEventGroupSync((event_group), (bits_to_set), \
                                                                          (bits_to_wait), (timeout))

/**
 * \brief Delete event group
 *
 * Function deletes an event group.
 *
 * \param [in] event_group the event group being deleted.
 *
 */
#define OS_EVENT_GROUP_DELETE(event_group) xEventGroupDelete(event_group)

/**
 * \brief Create OS queue
 *
 * Function creates OS queue that can contain \p max_items of specified size.
 *
 * \param [in,out] queue queue to initialize
 * \param [in] item_size queue element size
 * \param [in] max_items max number of items that queue can store
 *
 */
#define OS_QUEUE_CREATE(queue, item_size, max_items) \
                                do { (queue) = xQueueCreate((max_items), (item_size)); } while(0)

/**
 * \brief Deletes OS queue
 *
 * Function deletes OS.
 *
 * \param [in] queue queue to delete
 *
 */
#define OS_QUEUE_DELETE(queue) vQueueDelete(queue)

/**
 * \brief Put element in queue
 *
 * Function adds element into queue if there is enough room for it.
 * If there is no room in queue for \p timeout ticks element is not
 * put in queue and error is returned.
 *
 * \param [in] queue id of queue to put item to
 * \param [in] item pointer to element to enqueue
 * \param [in] timeout max time in ticks to wait for space in queue
 *
 * \return OS_QUEUE_FULL if there was no place in queue
 *         OS_QUEUE_OK if message was put in queue
 *
 */
#define OS_QUEUE_PUT(queue, item, timeout) xQueueSend((queue), (item), (timeout))

/**
 * \brief Put element in queue
 *
 * Function adds element into queue if there is enough room for it.
 * If there is no room in queue error is returned immediately.
 *
 * This is safe to call from ISR.
 *
 * \param [in] queue id of queue to put item to
 * \param [in] item pointer to element to enqueue
 *
 * \return OS_QUEUE_FULL if there was no place in queue
 *         OS_QUEUE_OK if message was put in queue
 *
 */
#define OS_QUEUE_PUT_FROM_ISR(queue, item) \
        ({ \
                BaseType_t need_switch, ret; \
                ret = xQueueSendToBackFromISR((queue), (item), &need_switch); \
                portEND_SWITCHING_ISR(need_switch); \
                ret; \
        })

