mikewang01/GOWATCH/ClingGo_NRF52/project/adapters/osal.h
/**
 * \brief Get element from queue
 *
 * Function adds element into queue if there is enough room for it.
 * If there is nothing in queue for \p timeout ticks error is returned.
 * Use OS_QUEUE_NO_WAIT for \p timeout to get message without waiting.
 * Use OS_QUEUE_FOREVER to wait till message arrives.
 *
 * \param [in] queue id of queue to get item from
 * \param [out] item pointer to buffer that will receive element from queue
 * \param [in] timeout max time in ticks to wait for element in queue
 *
 * \return OS_QUEUE_EMPTY if there was nothing in queue
 *         OS_QUEUE_OK if message was get from queue
 *
 */
#define OS_QUEUE_GET(queue, item, timeout) xQueueReceive((queue), (item), (timeout))

/**
 * \brief Peek element on queue
 *
 * Function gets element from queue without removing it.
 * If there is nothing in queue for \p timeout ticks error is returned.
 * Use OS_QUEUE_NO_WAIT for \p timeout to get message without waiting.
 * Use OS_QUEUE_FOREVER to wait till message arrives.
 *
 * \param [in] queue id of queue to get item from
 * \param [out] item pointer to buffer that will receive element from queue
 * \param [in] timeout max time in ticks to wait for element in queue
 *
 * \return OS_QUEUE_EMPTY if there was nothing in queue
 *         OS_QUEUE_OK if message was get from queue
 *
 */
#define OS_QUEUE_PEEK(queue, item, timeout) xQueuePeek((queue), (item), (timeout))

/**
 * \brief Create software timer
 *
 * Function creates software timer with given timeout
 *
 * \param [in] name     timer name
 * \param [in] period   timer period in ticks
 * \param [in] reload   indicates if callback will be called once or multiple times
 * \param [in] timer_id identifier which can be used to identify timer in callback function
 * \param [in] callback callback called when timer expires
 *
 * \return OS_TIMER if timer created successfully, otherwise null
 */
#define OS_TIMER_CREATE(name, period, reload, timer_id, callback) \
                        xTimerCreate((name), (period), ((reload) ? pdTRUE : pdFALSE), \
                                                        ((void *) (timer_id)), (callback))

/**
 * \brief Get timer ID
 *
 * Function returns timer_id assigned in OS_TIMER_CREATE
 *
 * \param [in] timer timer handle
 *
 * \return timer id
 */
#define OS_TIMER_GET_TIMER_ID(timer) pvTimerGetTimerID(timer)

/**
 * \brief Check if timer is active
 *
 * Function checks timer status
 *
 * \param [in] timer timer handle
 *
 * \return true if timer is active, otherwise false
 */
#define OS_TIMER_IS_ACTIVE(timer) xTimerIsTimerActive(timer)

/**
 * \brief Start timer
 *
 * Function starts timer
 *
 * \param [in]  timer timer handle returned in OS_TIMER_CREATE
 * \param [in]  timeout max time in ticks to wait until command is sent
 *
 * \return OS_TIMER_SUCCESS if command has been sent successfully,
 * or OS_TIMER_FAIL if timeout occur
 */
#define OS_TIMER_START(timer, timeout) xTimerStart((timer), (timeout))

/**
 * \brief Stop timer
 *
 * Function stops timer
 *
 * \param [in]  timer timer handle returned in OS_TIMER_CREATE
 * \param [in]  timeout max time in ticks to wait until command is sent
 *
 * \return OS_TIMER_SUCCESS if command has been sent successfully,
 * or OS_TIMER_FAIL if timeout occur
 */
#define OS_TIMER_STOP(timer, timeout) xTimerStop((timer), (timeout))

/**
 * \brief Change timer's period
 *
 * Functions updates timer's period
 *
 * \param [in] timer timer handle
 * \param [in] period new timer's period
 * \param [in] timeout max time in ticks to wait until command is sent
 *
 * \return OS_TIMER_SUCCESS if command has been sent successfully,
 * or OS_TIMER_FAIL if timeout occur
 */
#define OS_TIMER_CHANGE_PERIOD(timer, period, timeout) \
                                xTimerChangePeriod((timer), (period), (timeout))

/**
 * \brief Delete timer
 *
 * Function deletes previously created timer
 *
 * \param [in] timer timer handle
 * \param [in] timeout max time in ticks to wait until command is sent
 *
 * \return OS_TIMER_SUCCESS if command has been sent successfully,
 * or OS_TIMER_FAIL if timeout occur
 */
#define OS_TIMER_DELETE(timer, timeout) xTimerDelete((timer), (timeout))

/**
 * \brief Reset timer
 *
 * Function restarts previously created timer
 *
 * \param [in] timer timer handle
 * \param [in] timeout max time in ticks to wait until command is sent
 *
 * \return OS_TIMER_SUCCESS if command has been sent successfully,
 * or OS_TIMER_FAIL if timeout occur
 */
#define OS_TIMER_RESET(timer, timeout) xTimerReset((timer), (timeout))

/**
 * \brief Start timer from ISR
 *
 * Version of OS_TIMER_START that can be called from an interrupt service
 * routine
 *
 * \param [in] timer timer handle
 *
 * \return OS_TIMER_SUCCESS if command has been sent successfully,
 * otherwise OS_TIMER_FAIL
 *
 * \sa OS_TIMER_START()
 */
#define OS_TIMER_START_FROM_ISR(timer) \
({ \
        BaseType_t need_switch, ret; \
        ret = xTimerStartFromISR((timer), &(need_switch)); \
        portEND_SWITCHING_ISR(need_switch); \
        ret; \
})

/**
 * \brief Stop timer from ISR
 *
 * Version of OS_TIMER_STOP that can be called from an interrupt service
 * routine
 *
 * \param [in] timer timer handle
 *
 * \return OS_TIMER_SUCCESS if command has been sent successfully,
 * otherwise OS_TIMER_FAIL
 *
 * \sa OS_TIMER_STOP()
 */
#define OS_TIMER_STOP_FROM_ISR(timer) \
({ \
        BaseType_t need_switch, ret; \
        ret = xTimerStopFromISR((timer), &(need_switch)); \
        portEND_SWITCHING_ISR(need_switch); \
        ret; \
})

/**
 * \brief Change timer period from ISR
 *
 * Version of OS_TIMER_CHANGE_PERIOD that can be called from an interrupt service
 * routine
 *
 * \param [in] timer timer handle
 * \param [in] period new timer period
 *
 * \return OS_TIMER_SUCCESS if command has been sent successfully,
 * otherwise OS_TIMER_FAIL
 *
 * \sa OS_TIMER_CHANGE_PERIOD
 */
#define OS_TIMER_CHANGE_PERIOD_FROM_ISR(timer, period) \
({ \
        BaseType_t need_switch, ret; \
        ret = xTimerChangePeriodFromISR((timer), (period), &(need_switch)); \
        portEND_SWITCHING_ISR(need_switch); \
        ret; \
})

/**
 * \brief Reset timer from ISR
 *
 * Version of OS_TIMER_RESET that can be called from an interrupt service
 * routine
 *
 * \param [in] timer timer handle
 *
 * \return OS_TIMER_SUCCESS if command has been sent successfully,
 * otherwise OS_TIMER_FAIL
 *
 * \sa OS_TIMER_RESET()
 */
#define OS_TIMER_RESET_FROM_ISR(timer) \
({ \
        BaseType_t need_switch, ret; \
        ret = xTimerResetFromISR((timer), &(need_switch)); \
        portEND_SWITCHING_ISR(need_switch); \
        ret; \
})

/**
 * \brief Delay execution of task for specified time
 *
 * This function delays in OS specific way execution of current task.
 *
 * \param [in] ticks number of ticks to wait
 *
 */
#define OS_DELAY(ticks) vTaskDelay(ticks)

/**
 * \brief Get current tick count
 *
 * \return current tick count
 *
 */
#define OS_GET_TICK_COUNT() xTaskGetTickCount()

/**
 * \brief Convert from OS ticks to ms
 *
 * \param [in] ticks tick count to convert
 *
 * \return value in ms
 *
 */
#define OS_TICKS_2_MS(ticks) portCONVERT_TICKS_2_MS(ticks)

/**
 * \brief Convert from ms to OS ticks
 *
 * \param [in] ms milliseconds to convert
 *
 * \return value in OS ticks
 *
 */
#define OS_MS_2_TICKS(ms) portCONVERT_MS_2_TICKS(ms)

/**
 * \brief Delay execution of task for specified time
 *
 * This function delays in OS specific way execution of current task.
 *
 * \param [in] ms number of ms to wait
 *
 */
#define OS_DELAY_MS(ms) OS_DELAY(OS_MS_2_TICKS(ms))

/**
 * \brief Enter critical section
 *
 * This allows to enter critical section.
 * Implementation will disable interrupts with nesting counter.
 * This function can be called several time by task but requires same
 * number of OS_LEAVE_CRITICAL_SECTION calls to allow task switching and interrupts
 * again.
 *
 * \sa OS_LEAVE_CRITICAL_SECTION
 *
 */
#define OS_ENTER_CRITICAL_SECTION() //CRITICAL_REGION_ENTER()

/**
 * \brief Leave critical section
 *
 * Function restores interrupts and task switching.
 * Number of calls to this function must match number of calls to OS_ENTER_CRITICAL_SECTION.
 *
 * \sa OS_ENTER_CRITICAL_SECTION
 *
 */ 
#define OS_LEAVE_CRITICAL_SECTION() //CRITICAL_REGION_EXIT()

/**
 * \brief Name for OS memory allocation function
 *
 * \sa OS_MALLOC
 *
 */
#define OS_MALLOC_FUNC pvPortMalloc

/**
 * \brief Name for non-retain memory allocation function
 *
 * \sa OS_MALLOC_FUNC
 *
 */
#define OS_MALLOC_NORET_FUNC pvPortMalloc

/**
 * \brief Allocate memory from OS provided heap
 *
 * \sa OS_FREE
 *
 */
#define OS_MALLOC(size) OS_MALLOC_FUNC(size)

/**
 * \brief Allocate memory from non-retain heap
 *
 * \sa OS_FREE
 *
 */
#define OS_MALLOC_NORET(size) OS_MALLOC_NORET_FUNC(size)

/**
 * \brief Name for OS free memory function
 *
 * \sa OS_FREE
 *
 */
#define OS_FREE_FUNC vPortFree

/**
 * \brief Name for non-retain memory free function
 *
 * \sa OS_FREE_NORET
 * \sa OS_MALLOC_NORET
 *
 */
#define OS_FREE_NORET_FUNC vPortFree

/**
 * \brief Free memory allocated by OS_MALLOC()
 *
 * \sa OS_MALLOC
 *
 */
#define OS_FREE(addr) OS_FREE_FUNC(addr)

/**
 * \brief Free memory allocated by OS_MALLOC_NORET()
 *
 * \sa OS_MALLOC_NORET
 *
 */
#define OS_FREE_NORET(addr) OS_FREE_NORET_FUNC(addr)

#endif

#if defined OS_BAREMETAL
/*
 * Basic set of macros that can be used in non OS environment.
 */
# define PRIVILEGED_DATA
# define OS_MALLOC malloc
# define OS_FREE free
# ifndef RELEASE_BUILD
#  define OS_ASSERT(a) do { if (!a) {__BKPT(0);} } while (0)
# else
#  define OS_ASSERT(a) ((void) (a))
# endif

#endif

/**
 * \brief Cast any pointer to unsigned int value
 */
#define OS_PTR_TO_UINT(p) ((unsigned) (void *) (p))

/**
 * \brief Cast any pointer to signed int value
 */
#define OS_PTR_TO_INT(p) ((int) (void *) (p))

/**
 * \brief Cast any unsigned int value to pointer
 */
#define OS_UINT_TO_PTR(u) ((void *) (unsigned) (u))

/**
 * \brief Cast any signed int value to pointer
 */
#define OS_INT_TO_PTR(i) ((void *) (int) (i))

#endif /* OSAL_H_ */

/**
 * \}
 * \}
 * \}
 */
